---
kind: property
id: P:Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ElectricalAnalyticalLoadCombinationUIService
source: html/d501520d-2de8-9ced-092c-b24fc16d9e77.htm
---
# Autodesk.Revit.DB.ExternalService.ExternalServices.BuiltInExternalServices.ElectricalAnalyticalLoadCombinationUIService Property

The UI service which permits registration of an external server for UI managing Electrical Analytical Load Combination.

## Syntax (C#)
```csharp
public static ExternalServiceId ElectricalAnalyticalLoadCombinationUIService { get; }
```